# ・system分解について		

元となる話をこれから指定する方法で、要素に分割し、構造化します。この過程をsystem分解と呼びます。		
以下に制作方法等を示します。		

* 1\. 話(a story)を準備します。ある物語全部でも、一部でもかまいません。		
* 2\. その話を、｛ (後置型の接続詞を伴う節）＋主文 ｝という形の一文で表します。		
* 3\. 前半の文と後半の文を分割し、上下に配置します。前半の文からは接続詞を排除します。		
* 4\. この二つの文をそれぞれ定義するような単語を作り、小括弧で囲み、文の先頭に設置します。		
* 5\. それぞれの文の塊の左側に物語Lvを記入します。以上の流れで作ったものがシナリオ原基です。		

例: 元の文章 「鬼が悪さをしていたから、桃太郎が鬼を退治した」		
　  Lv5 (悪行) 鬼が悪さをしていた		
　  Lv5 (成敗) 桃太郎が鬼を倒した		

* 6\. シナリオ原基の中にイベントカードを入れます。イベントカードとは、「物語Lv (要素を定義付ける単語) 要素」　左のような構成をしている文章のことです。		
* 7\. シナリオ原基で挟まれている話のうち、どの話を抜き取って要素とするかは任意です。加えて、その要素をどう定義付けるかも任意です。		
   要素とは、「が」や「は」が存在しない文または節のことです。		
* 8\. また、要素とした話の中に、細かく話を設けたいときは、さらに分割してイベントカードを作ってください。		
* 9\. ただし、物語Lvについては、シナリオ原基と同じか小さい値を取り、イベントカードを分割するほど減少していきます。以上の流れで作ったものがシナリオです。		

| | | |
| :------------- | :------------- | :------------- | 
| Lv5 (悪行) 鬼が悪さをしていた|　|　|
| | Lv4 (抵抗)  鬼と戦う |　|
| | | Lv3 (死傷) 村人の傷|
| Lv5 (襲撃) 鬼による財宝の強奪|　|　|
| | Lv4 (奪取) 一部の宝を取り戻す|　|
| | Lv4 (進攻) 鬼ヶ島に向かう|　|
| | Lv4 (戦闘) 鬼を切る|　|
| | | Lv3 (部位) 鬼の首を獲る|
| | Lv4 (宣言) 鬼の降伏 | |
| Lv5 (成敗) 桃太郎が鬼を倒した | | |		

* A. イベントカードは、最初から明示する物と、機会によって明示する物の2つがあります。		
* B. PLが必要とあれば、セッション中に現在扱っているイベントカードか、それ以降のイベントカードに対し、新しく分割したイベントカードを作っても構いません。		
* C. 時系列といった物語の遷移を考える場合、イベントカードをlv-t座標に配置します。		
* D. x軸に物語Lvを取り、y軸に時間tを取ります。		
* E. どのように配置するかは任意です。ただし、シナリオに矛盾が生じないように気をつけてください。		
* F. セッション時に運用する際は、イベントカードの右側に「（障害：n）」という形で、後述する障害ポイントを記載してください。
